import React from "react";
import { Box, Flex, Link, chakra } from "@chakra-ui/react";
import UniversalNav from "../../components/UniversalNav";

function About() {
  return (
    <div>
      <UniversalNav />
      {/* Main content */}
      <Flex
        bg="#edf3f8"
        _dark={{ bg: "#3e3e3e" }}
        p={70}
        w="full"
        alignItems="center"
        justifyContent="center"
      >
        <Box
          bg="white"
          _dark={{ bg: "gray.250" }}
          mx={{ lg: 16 }}
          display={{ lg: "flex" }}
          maxW={{ lg: "5x1" }}
          shadow={{ lg: "lg" }}
          rounded={{ lg: "lg" }}
        >
          {/* Left Column with Image */}
          <Box w={{ lg: "35%" }}>
            <img
              src="https://scontent.fhdy3-1.fna.fbcdn.net/v/t39.30808-6/326897136_919582616121163_3977714351364493802_n.jpg?_nc_cat=108&ccb=1-7&_nc_sid=a2f6c7&_nc_eui2=AeFR2YRuyi0mkuT1C5RL78cp4ajFokieklbhqMWiSJ6SVqxZTBVyuYKqG_vIV1zMsbJ7-7_D1TgB0270YHYWVaos&_nc_ohc=dRS3kKE-h64AX_O4V76&_nc_ht=scontent.fhdy3-1.fna&oh=00_AfBf1fVW-vgLagIzT941-Qj1IlQxmdVPU4vduyCUKT7FVg&oe=65172415"
              alt="Background"
              width="100%"
              height="100%"
              style={{ objectFit: "contain" }}
            />
          </Box>

          {/* Right Column */}
          <Box py={7} px={7} maxW={{ base: "xl", lg: "5xl" }} w={{ lg: "100%" }}>
            <chakra.h1
              fontSize={{ base: "2xl", md: "2xl" }}
              color="gray.800"
              _dark={{ color: "white" }}
              fontWeight="bold"
            >
              ชมรมศิลปะการถ่ายภาพ มหาวิทยาลัยสงขลานครินทร์
              <chakra.span color="brand.600" _dark={{ color: "brand.400" }}>
              </chakra.span>
            </chakra.h1>
            <chakra.p mt={7} color="gray.600" _dark={{ color: "gray.400" }}>
              ชมรมศิลปะการถ่ายภาพ มหาวิทยาลัยสงขลานครินทร์ เกิดขึ้นเมื่อประมาณปีพุทธศักราช 2514 มีประวัติยาวนานและเป็นองค์กรที่มีบทบาทสำคัญในการสนับสนุนกิจกรรมต่าง ๆ ของมหาวิทยาลัยผ่านศิลปะการถ่ายภาพ เพื่อนำเสนอและเผยแพร่ชื่อเสียงของมหาวิทยาลัยไปยังสายตาของสาธารณชนทั่วไป

              ชมรมศิลปะการถ่ายภาพ มหาวิทยาลัยสงขลานครินทร์ ได้รับการพัฒนาและส่งเสริมกิจกรรมที่หลากหลายของมหาวิทยาลัยและกิจกรรมภายในคณะต่าง ๆ อย่างต่อเนื่อง โดยการถ่ายภาพเป็นช่องทางสื่อสารสำคัญ เพื่อประชาสัมพันธ์กิจกรรมและความคืบหน้าของมหาวิทยาลัยอย่างมีประสิทธิภาพ

              นอกจากนี้ ชมรมยังมีการสนับสนุนกิจกรรมทางศิลปะและการแสดงอย่างมากมายในวงการคณะต่าง ๆ ของมหาวิทยาลัย ผ่านการถ่ายภาพที่น่าสนใจและเป็นศิลปะ รวมถึงการจัดโครงการที่ส่งเสริมการเรียนรู้และพัฒนาทักษะด้านการถ่ายภาพให้แก่นักศึกษา โดยเฉพาะ

              ปัจจุบันชมรมมีโครงการประจำปีอยู่ทั้งหมด 5 โครงการที่น่าตื่นเต้น เพื่อสร้างความสนใจและความท้าทายในการถ่ายภาพ ได้แก่ โครงการ "ถ่ายอย่างไร ถ่ายให้เป็น" ที่เน้นการสร้างผลงานที่เป็นเอกลักษณ์และนักถ่ายภาพจะต้องสร้างสรรค์ไอเดียอย่างเจาะลึก, โครงการ "ถ่ายภาพขาว-ดำ" ที่เน้นความเป็นคลาสสิกและความหลังที่เน้นไปทางแสงและเงา, โครงการ "Fashion Photography" ที่นำเสนอโลกแฟชั่นและสตูดิโอเซสชันที่สวยงาม, และโครงการ "สะพายเป้แบกกล้อง" ที่เน้นการเดินทางและการถ่ายภาพที่เป็นเรื่องราว นอกจากนี้ยังมีโครงการนิทรรศการภาพถ่ายที่นำเสนอผลงานออกสื่อและเผยแพร่ความสวยงามของศิลปะการถ่ายภาพให้กับชุมชนมหาวิทยาลัยและสาธารณชนทั่วไปอย่างสร้างสรรค์และน่าสนใจมากยิ่งขึ้น ชมรมศิลปะการถ่ายภาพนับเป็นส่วนสำคัญที่ให้ความสำคัญกับการพัฒนาและส่งเสริมทักษะศิลปะการถ่ายภาพในมหาวิทยาลัยสงขลานครินทร์ และเป็นองค์กรที่มีผลกระทบในการเสริมสร้างบรรยากาศที่เต็มไปด้วยความสร้างสรรค์และความหลงใสในการถ่ายภาพในคณะนักศึกษาและชุมชนทั่วไปของมหาวิทยาลัยสงขลานครินทร์
            </chakra.p>
          </Box>
        </Box>
      </Flex>
    </div>
  );
}

export default About;
